use utf8;
use Encode;

open(di,"all.log");
open(fr,"freq.log");
open(out,">weighted.log");
while(<fr>){
if(/(.+) \((\d+)\)/){
$count=$2;
$testword=lc(decode_utf8($1));
$testword=~s/ё/е/g;
$testword=~s/(ЙЕЧИВО|ЙЕЧИВ|АЧИВО|ЙЕЧИ|АЧИВ|ЙОКС|ОГОН|НЕВО|ЫНВО|ЕНВО|ИМА|ЙОН|ОГО|УМО|ЙОК|ХЫН|НЕВ|ЙЕЧ|ЫНВ|АЧИ|ЕНВ|МЫН|ЙОВ|ХИК|МОН|МИК|ЙО|ИМ|ОГ|МА|ХА|ЙЕ|МО|ХЫ|ЫН|МЫ|УМ|ЯС|ВО|ЕН|АН|ЕО|НЕ|МИ|ХИ|МЕ|АЧ|ЙИ|ЮО|УН|ЕИ|ЮУ|ЯА|ЕЫ|М|Й|Е|И|Х|А|У|О|Ы|Я|Ю|В|Н)$//si;
$words{$testword}+=$count;
}
}
binmode(di,":utf8");
while(<di>){
@fields=split(/\t+/,$_);
$testword=lc($fields[1]);
$testword=~s/ё/е/g;
$testword=~s/(ЙЕЧИВО|ЙЕЧИВ|АЧИВО|ЙЕЧИ|АЧИВ|ЙОКС|ОГОН|НЕВО|ЫНВО|ЕНВО|ИМА|ЙОН|ОГО|УМО|ЙОК|ХЫН|НЕВ|ЙЕЧ|ЫНВ|АЧИ|ЕНВ|МЫН|ЙОВ|ХИК|МОН|МИК|ЙО|ИМ|ОГ|МА|ХА|ЙЕ|МО|ХЫ|ЫН|МЫ|УМ|ЯС|ВО|ЕН|АН|ЕО|НЕ|МИ|ХИ|МЕ|АЧ|ЙИ|ЮО|УН|ЕИ|ЮУ|ЯА|ЕЫ|М|Й|Е|И|Х|А|У|О|Ы|Я|Ю|В|Н)$//si;

if($words{$testword}){
push(@res,[$words{$testword},$words{$testword}."\t".$_]);
}

}


print out map{$_->[1]}sort{$b->[0] <=> $a->[0]}@res;
